Câu 9:
(a) i1 + (i2 * i3) = -13
(b) i1 * (i2 + i3) = 4
(c) i1 / (i2 + i3) = 1.0 (lấy phần thực)
(d) i1 // (i2 + i3) = 1 (chia lấy phần nguyên)
(e) i1 / i2 + i3 = -2.6
(f) i1 // i2 + i3 = -3
(g) 3 + 4 + 5 / 3 = 8.666...
(h) 3 + 4 + 5 // 3 = 8
(i) (3 + 4 + 5) / 3 = 4.0
(j) (3 + 4 + 5) // 3 = 4
(k) d1 + (d2 * d3) = -0.5
(l) d1 + d2 * d3 = -0.5
(m) d1 / d2 - d3 = 0.9
(n) d1 / (d2 - d3) = 0.3636
(o) d1 + d2 + d3 / 3 = 6.833...
(p) (d1 + d2 + d3) / 3 = 2.166...
(q) d1 + d2 + (d3 / 3) = 6.833...
(r) 3 * (d1 + d2) * (d1 - d3) = 52.5

Câu 10: 
a) x += 1
b) x /= 2
c) x -= 1
d) x += y
e) x -= (y + 7)
f) x *= 2
g) number_of_closed_cases += 2 * ncc
